# Transform Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform Constructor
Transform Class See Also
---
The copy constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Transform(
	Transform source
)
```

Visual Basic
---
```text
Public Sub New ( _
	source As Transform _
)
```

Visual C++
---
```text
public:
Transform(
	Transform^ source
)
```

# ### Parameters
source
    Type: Autodesk.Revit.DB..::..Transform
# See Also
Transform Class
Autodesk.Revit.DB Namespace